KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/Mcl/Inc/Reg_eSys_eMios.h
#define CCR_FCK_MASK_U32            ((uint32)(BIT18))
#define CCR_FCK_SHIFT               ((uint32)(18U))

#define CCR_FEN_MASK_U32            ((uint32)(BIT17))
#define CCR_FEN_SHIFT               ((uint32)(17U))

#define CCR_FORCMA_MASK_U32         ((uint32)(BIT13))
#define CCR_FORCMA_SHIFT            ((uint32)(13U))

#define CCR_FORCMB_MASK_U32         ((uint32)(BIT12))
#define CCR_FORCMB_SHIFT            ((uint32)(12U))

#define CCR_BSL_MASK_U32            ((uint32)(BIT10|BIT9))
#define CCR_BSL_SHIFT               ((uint32)(9U))

#define CCR_EDSEL_MASK_U32          ((uint32)(BIT8))
#define CCR_EDSEL_SHIFT             ((uint32)(8U))

#define CCR_EDPOL_MASK_U32          ((uint32)(BIT7))
#define CCR_EDPOL_SHIFT             ((uint32)(7U))

/* EDGE select mask - part of MODE field */
#define CCR_MODE_EDGE_SELECT_MASK_U32               ((uint32)(BIT1))
#define CCR_MODE_EDGE_SELECT_SHIFT                  ((uint32)(1U))

/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_DAOC_MODE_EDGE_SELECT_MASK_U32          ((uint32)(BIT0))
#define CCR_MCB_MODE_U32                            ((uint32)(BIT4|BIT6))
#define CCR_MC_MODE_U32                             ((uint32)(BIT4))

#define CCR_MODE_MASK_U32                           ((uint32)(BIT6|BIT5|BIT4|BIT3|BIT2|BIT1|BIT0))
#define CCR_MODE_SHIFT                              ((uint32)(0U))
/**@}*/

/**
* @{
* @brief CSR[n] - unified channel N status register
*/
#define CSR_OVR_MASK_U32                            ((uint32)(BIT31))
#define CSR_OVR_SHIFT                               ((uint32)(31U))

#define CSR_OVFL_MASK_U32                           ((uint32)(BIT15))
#define CSR_OVFL_SHIFT                              ((uint32)(15U))

#define CSR_UCIN_MASK_U32                           ((uint32)(BIT2))
#define CSR_UCIN_SHIFT                              ((uint32)(2U))

#define CSR_UCOUT_MASK_U32                          ((uint32)(BIT1))
#define CSR_UCOUT_SHIFT                             ((uint32)(1U))

#define CSR_FLAG_MASK_U32                           ((uint32)(BIT0))
#define CSR_FLAG_SHIFT                              ((uint32)(0U))
/**@}*/

/**
* @{
* @brief ALTA[n] - unified channel N alternate A register
*/
/* Mask and shift defines are not needed */
/**@}*/

/** Bitfield defines. */

/**
* @{
* @brief MCR - bitfield defines.
*/
#define MCR_DOZEEN_ENABLE_U32      ((uint32)(0U))
#define MCR_DOZEEN_DISABLE_U32     ((uint32)(1U))

#define MCR_MDIS_CLK_ON_U32        ((uint32)(0U))
#define MCR_MDIS_LOW_POWER_U32     ((uint32)(1U))

#define MCR_FRZ_DISABLE_U32        ((uint32)(0U))
#define MCR_FRZ_ENABLE_U32         ((uint32)(1U))

#define MCR_GTBE_DISABLE_U32       ((uint32)(0U))
#define MCR_GTBE_ENABLE_U32        ((uint32)(1U))

#define MCR_ETB_UC_U32             ((uint32)(0U))
#define MCR_ETB_STAC_U32           ((uint32)(1U))

#define MCR_GPREN_DISABLE_U32      ((uint32)(0U))
#define MCR_GPREN_ENABLE_U32       ((uint32)(1U))

#define MCR_SRV_ETPUTA_TCR1_U32    ((uint32)(0U))
#define MCR_SRV_ETPUTB_TCR1_U32    ((uint32)(1U))
#define MCR_SRV_ETPUTA_TCR2_U32    ((uint32)(2U))
#define MCR_SRV_ETPUTB_TCR2_U32    ((uint32)(3U))
/**@}*/

/**
* @{
* @brief GFR - bitfield defines.
*/
/* bitfields for this register are not needed */
/**@}*/

/**
* @{
* @brief OUDR - bitfield defines.
*/
/* bitfields for this register are not needed */
/**@}*/

/**
* @{
* @brief CADR[n] - bitfield defines.
*/
/* bitfields for this register are not needed */
/**@}*/

/**
* @{
* @brief CBDR[n] - bitfield defines.
*/
/* bitfields for this register are not needed */
/**@}*/

/**
* @{
* @brief CCNTR[n] - bitfield defines.
*/
/* bitfields for this register are not needed */
/**@}*/

/**
* @{
* @brief CCR[n] - bitfield defines.
*/
#define CCR_FREN_DISABLE_U32     ((uint32)(0U))
#define CCR_FREN_ENABLE_U32      ((uint32)(1U))

#define CCR_ODIS_DISABLE_U32     ((uint32)(0U))
#define CCR_ODIS_ENABLE_U32      ((uint32)(1U))

#define CCR_ODISSL_IN_0_U32      ((uint32)(0U))
#define CCR_ODISSL_IN_1_U32      ((uint32)(1U))
#define CCR_ODISSL_IN_2_U32      ((uint32)(2U))
#define CCR_ODISSL_IN_3_U32      ((uint32)(3U))

#define CCR_UCPRE_DIV_1_U32      ((uint32)(0U))
#define CCR_UCPRE_DIV_2_U32      ((uint32)(1U))
#define CCR_UCPRE_DIV_3_U32      ((uint32)(2U))
#define CCR_UCPRE_DIV_4_U32      ((uint32)(3U))

#define CCR_UCPREN_DISABLE_U32   ((uint32)(0U))
#define CCR_UCPREN_ENABLE_U32    ((uint32)(1U))

#define CCR_DMA_ASSIGN_INT_U32   ((uint32)(0U))
#define CCR_DMA_ASSIGN_DMA_U32   ((uint32)(1U))

#define CCR_IF_BYPASSED_U32      ((uint32)(0U))
#define CCR_IF_2_PERIODS_U32     ((uint32)(1U))
#define CCR_IF_4_PERIODS_U32     ((uint32)(2U))
#define CCR_IF_8_PERIODS_U32     ((uint32)(4U))
#define CCR_IF_16_PERIODS_U32    ((uint32)(8U))

#define CCR_FCK_PRESCALED_U32    ((uint32)(0U))
#define CCR_FCK_MAIN_U32         ((uint32)(1U))

#define CCR_FEN_DISABLE_U32      ((uint32)(0U))
#define CCR_FEN_ENABLE_U32       ((uint32)(1U))

#define CCR_FORCMA_DISABLE_U32   ((uint32)(0U))
#define CCR_FORCMA_ENABLE_U32    ((uint32)(1U))

#define CCR_FORCMB_DISABLE_U32   ((uint32)(0U))
#define CCR_FORCMB_ENABLE_U32    ((uint32)(1U))

#define CCR_BSL_BUS_A_U32        ((uint32)(0U))
#define CCR_BSL_BUS_DIVERSE_U32  ((uint32)(1U))
#define CCR_BSL_BUS_F_U32        ((uint32)(2U))
#define CCR_BSL_INT_COUNTER_U32  ((uint32)(3U))

#define CCR_EDSEL_0_U32          ((uint32)(0U))
#define CCR_EDSEL_1_U32          ((uint32)(1U))

#define CCR_EDPOL_0_U32          ((uint32)(0U))
#define CCR_EDPOL_1_U32          ((uint32)(1U))

/* Unified channel mode field */
#define CCR_MODE_GPI_U32         ((uint32)(0x00))
#define CCR_MODE_GPO_U32         ((uint32)(0x01))
#define CCR_MODE_SAIC_U32        ((uint32)(0x02))
#define CCR_MODE_SAOC_U32        ((uint32)(0x03))
#define CCR_MODE_IPWM_U32        ((uint32)(0x04))
#define CCR_MODE_IPM_U32         ((uint32)(0x05))
#define CCR_MODE_DAOC_U32        ((uint32)(0x06))
#define CCR_MODE_DAOC_BOTH_U32   ((uint32)(0x07))

#define CCR_MODE_PEA_CONT_U32    ((uint32)(0x08))
#define CCR_MODE_PEA_SINGLE_U32  ((uint32)(0x09))
#define CCR_MODE_PEC_CONT_U32    ((uint32)(0x0A))
#define CCR_MODE_PEC_SINGLE_U32  ((uint32)(0x0B))

