KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/Mcl/Inc/Reg_eSys_eMios.h
#define CCR_MODE_QDEC_COUNT_U32  ((uint32)(0x0C))
#define CCR_MODE_QDEC_PHASE_U32  ((uint32)(0x0D))

#define CCR_MODE_WPTA_U32        ((uint32)(0x0E))

/* CCR_MODE_ 0x0F reserved */
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_MC_UP_CLEAR_START_INT_CLOCK_U32             ((uint32)(0x10))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_MC_UP_CLEAR_START_EXT_CLOCK_U32             ((uint32)(0x11))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_MC_UP_CLEAR_END_INT_CLOCK_U32               ((uint32)(0x12))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_MC_UP_CLEAR_END_EXT_CLOCK_U32               ((uint32)(0x13))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_MC_UP_DOWN_FLAG_A_INT_CLOCK_U32             ((uint32)(0x14))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_MC_UP_DOWN_FLAG_A_EXT_CLOCK_U32             ((uint32)(0x15))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_MC_CHANGE_DIR_INT_CLOCK_U32                 ((uint32)(0x16))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_MC_CHANGE_DIR_EXT_CLK_U32                   ((uint32)(0x17))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWFM_FLAG_B_IMMEDIATE_U32                  ((uint32)(0x18))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWFM_FLAG_B_NEXT_PERIOD_U32                ((uint32)(0x19))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWFM_FLAG_A_FLAG_B_IMMEDIATE_U32           ((uint32)(0x1A))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWFM_FLAG_A_FLAG_B_NEXT_PERIOD_U32         ((uint32)(0x1B))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWMC_FLAG_TRAILING_TRAILING_DEAD_TIME_U32  ((uint32)(0x1C))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWMC_FLAG_TRAILING_LEADING_DEAD_TIME_U32   ((uint32)(0x1D))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWMC_FLAG_BOTH_TRAILING_DEAD_TIME_U32      ((uint32)(0x1E))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWMC_FLAG_BOTH_LEADING_DEAD_TIME_U32       ((uint32)(0x1F))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWM_FLAG_B_IMMEDIATE_U32                   ((uint32)(0x20))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWM_FLAG_B_NEXT_PERIOD                 ((uint32)(0x21))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWM_FLAG_A_FLAG_B_IMMEDIATE_U32            ((uint32)(0x22))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWM_FLAG_A_FLAG_B_NEXT_PERIOD_U32          ((uint32)(0x23))
#define CCR_EDPOL_N_MODE_MASK_U32                            ((uint32)(0xFFU))
#define CCR_EDPOL_N_MODE_SET_U32                             ((uint32)(0xA6U))
#define CCR_EDPOL_N_MODE_CLEAR_U32                           ((uint32)(0x26U))
/* CCR_MODE_ 0x24, 0x25 reserved */
/* Output Pulse Width Modulation with Trigger - not available on all EMIOS IP versions */
#define CCR_MODE_OPWMT_U32                                   ((uint32)(0x26))
/* CCR_MODE_ 0x27 ... 0x4F reserved */
#define CCR_MODE_MCB_INT_CLOCK_U32                           ((uint32)(0x50))
#define CCR_MODE_MCB_EXT_CLOCK_U32                           ((uint32)(0x51))
/* CCR_MODE_ 0x52, 0x53 reserved */
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_MCB_FLAG_A_INT_CLOCK_U32                    ((uint32)(0x54))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_MCB_FLAG_A_EXT_CLOCK_U32                    ((uint32)(0x55))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_MCB_FLAG_A_CYCLE_INT_CLOCK_U32              ((uint32)(0x56))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_MCB_FLAG_A_CYCLE_EXT_CLOCK_U32              ((uint32)(0x57))
#define CCR_MODE_OPWFMB_FLAG_B_U32                           ((uint32)(0x58))
/* CCR_MODE_ 0x59 reserved */
#define CCR_MODE_OPWFMB_FLAG_AB_U32                          ((uint32)(0x5A))
/* CCR_MODE_ 0x5B reserved */
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWMCB_FLAG_TRAILING_TRAILING_DEAD_TIME_U32        ((uint32)(0x5C))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWMCB_FLAG_TRAILING_LEADING_DEAD_TIME_U32         ((uint32)(0x5D))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWMCB_FLAG_BOTH_TRAILING_DEAD_TIME_U32            ((uint32)(0x5E))
/** @violates @ref REG_ESYS_EMIOS_H_4 This is required as per autosar Requirement */
#define CCR_MODE_OPWMCB_FLAG_BOTH_LEADING_DEAD_TIME_U32             ((uint32)(0x5F))
#define CCR_MODE_OPWMB_FLAG_B_U32                                   ((uint32)(0x60))
/* CCR_MODE_ 0x61 reserved */
#define CCR_MODE_OPWMB_FLAG_AB_U32                                  ((uint32)(0x62))
/* CCR_MODE_ 0x63 0x3F reserved */
/**@}*/

/**
* @{
* @brief CSR[n] - bitfield defines.
*/
/* only w1c bits */
#define CSR_OVR_BIT_U32           ((uint32)(BIT31))
#define CSR_OVFL_BIT_U32          ((uint32)(BIT15))
#define CSR_FLAG_BIT_U32          ((uint32)(BIT0))
/**@}*/

/**
* @{
* @brief ALTA[n] - bitfield defines.
*/
/* bitfields for this register are not needed */
/**@}*/

/*==================================================================================================
                                             ENUMS
==================================================================================================*/

/*==================================================================================================
                                 STRUCTURES AND OTHER TYPEDEFS
==================================================================================================*/

/*==================================================================================================
                                     FUNCTION PROTOTYPES
==================================================================================================*/

#ifdef __cplusplus
}
#endif

#endif /* REG_ESYS_EMIOS_H */
/** @} */

